# Pandas

In [1]:
# import pandas
import pandas as pd

### Group by 
Aggregate rows by certain variables. 

Other aggregation functions: 

- sum(): Sum values of each category
- count(): Count number of each category
- median(): Median value of each category
- min(): Minimum value in each category
- max(): Maximum value in each category
- mean(): Mean value of each category
- var(): Variance of each category
- std(): Standard deviation of each category

In [2]:
df = pd.read_csv('tips.csv')

In [3]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
df.groupby('sex').mean()

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\3838006174.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('sex').mean()

        total_bill       tip      size
sex
Female   18.056897  2.833448  2.459770
Male     20.744076  3.089618  2.630573

In [5]:
df.groupby('day').sum()

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\3732407944.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('day').sum()

      total_bill     tip  size
day
Fri       325.88   51.96    40
Sat      1778.40  260.40   219
Sun      1627.16  247.39   216
Thur     1096.33  171.83   152

In [6]:
df.groupby('day').sum()[['total_bill']]

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\730023460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('day').sum()[['total_bill']]

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [7]:
df.groupby('time').max()

        total_bill   tip   sex smoker   day  size
time
Dinner       50.81  10.0  Male    Yes  Thur     6
Lunch        43.11   6.7  Male    Yes  Thur     6

In [8]:
df.groupby(['day', 'time']).sum()

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\335277826.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['day', 'time']).sum()

             total_bill     tip  size
day  time
Fri  Dinner      235.96   35.28    26
     Lunch        89.92   16.68    14
Sat  Dinner     1778.40  260.40   219
Sun  Dinner     1627.16  247.39   216
Thur Dinner       18.78    3.00     2
     Lunch      1077.55  168.83   150

In [9]:
df.groupby('time').sum().reset_index()

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\2032652322.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('time').sum().reset_index()

     time  total_bill     tip  size
0  Dinner     3660.30  546.07   463
1   Lunch     1167.47  185.51   164

In [10]:
df.groupby('time').sum()[['tip']]

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\1792093101.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('time').sum()[['tip']]

           tip
time
Dinner  546.07
Lunch   185.51

### Sort values

In [11]:
df.sort_values(by='tip').head(10)

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
236       12.60  1.00    Male    Yes   Sat  Dinner     2
92         5.75  1.00  Female    Yes   Fri  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
0         16.99  1.01  Female     No   Sun  Dinner     2
215       12.90  1.10  Female    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
75        10.51  1.25    Male     No   Sat  Dinner     2
135        8.51  1.25  Female     No  Thur   Lunch     2

In [12]:
df.sort_values(by='tip', ascending=False).head(10)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
214       28.17   6.50  Female    Yes   Sat  Dinner     3
183       23.17   6.50    Male    Yes   Sun  Dinner     4
47        32.40   6.00    Male     No   Sun  Dinner     4
239       29.03   5.92    Male     No   Sat  Dinner     3
88        24.71   5.85    Male     No  Thur   Lunch     2

In [13]:
df.groupby('day').sum().sort_values('tip')

C:\Users\andyc\AppData\Local\Temp\ipykernel_11884\3680325927.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('day').sum().sort_values('tip')

      total_bill     tip  size
day
Fri       325.88   51.96    40
Thur     1096.33  171.83   152
Sun      1627.16  247.39   216
Sat      1778.40  260.40   219